// Реализуйте функцию enlargeArrayImage, которая принимает изображение в виде двумерного массива и увеличивает его в два раза.
// Пример:
const arr = [
  ['*', '*', '*', '*'],
  ['*', ' ', ' ', '*'],
  ['*', ' ', ' ', '*'],
  ['*', '*', '*', '*'],
];
// ********
// ********
// **    **
// **    **
// **    **
// **    **
// ********
// ********

//Решение
function enlargeArrayImage(mass) {
  return mass.reduce((acc, curr) => {
    let res = curr.reduce((acc, curr) => [...acc, curr, curr], []);
    return [ ...acc, res, res];
  }, []);
}