// Реализуйте и экспортируйте функцию по умолчанию, которая находит пересечение двух массивов. Пересечение двух массивов A и B — это массив только с теми элементами A и B, которые одновременно принадлежат обоим массивам, без дублей.
// Обратите внимание, что порядок значений в пересечении должен соответствовать порядку появления этих значений в исходных массивах (сначала в первом переданном массиве, потом - во втором).

const intersection = (massA, massB) =>
  [...new Set(massA.filter(item => massB.includes(item)))];

// intersection([2, 1], [2, 3]);
// → [2]
// intersection([3, 1, 3], [3, 3, 2]);
// → [3]